//alert("Privet mir");

// Введение в программирование. Первые шаги
// Императивное программирование
// Декларативное программирование
// Процедурное
// Функциональное
// ООП - Объектно-ориентированное программирование

/*
многострочный
 */
// однострочный

/*
() [] {} ^^ || && %% __ -- ** ++ // \\ '' "" `` ¬¬ ;; :: ,, .. <> == !=
*/

console.log("Проверкв выдачи");

// let t = document.querySelector("p");
// console.log(t);
// t.style.color="blue";

let deli;
deli = 10;
let b = 5;
let c = a +b;
console.log(c);

let d1, d2, d3, d4;
d1 = "pervoe maia";
d2 = "vtoroe maia";

//строготипизироывнные, 
//слаботипизированные.
// си - подобные языки, псевдокод
// java - подобные ->> котлин
// javascript ->> dart, typescript
let bb = 50;
bb="Добро пожаловать на нашем сайте!"